# Transforming DataFrames

Let's say we have a DataFrame named df. 

When we first receive a dataset, we want to quickly explore it and get a sense of its content: 
1. ```print(df.head())``` is a way of getting info, which displays first 5 rows of the data.
2. ```print(df.info())``` displays the names of the columns, the data types they contain, and whether they have ant missing _values_.
3. ```print(df.shape)``` contains a tuple that shows the number of rows and number of columns, (nr of rows, nr of columns)

    Since .shape is an _attribute_, not a _method_, we write it without parantheses.
4. ```print(df.describe())``` method computes some summary _statistics_ for _numerical columns_, such as _mean_, _standard deviaton_, _min_, _max_, and _count_. ___count___ is the number of non-missing values in each column.
5. DataFrames consists of three different components, accesible using attribues.
    + `print(df.values)` prints out an array of columns (think of df as a dictionary where column labels are keys, and inputs are values), and the datatype. So, the _values_ attribute contains the data values in a 2-dim'l NumPy array.
    + The other two are `print(df.columns)` and `print(df.index)`, labels for columns and rows. These are contains column names, and row numbers (or row names), respectively.

In [ ]:
# We first import pandas, then read homelessness dataset and perform the above marks.
import pandas as pd

#pd.set_option('display.expand_frame_repr', False)   # Make the display wider.

homelessness = pd.read_csv('./datasets/homelessness.csv')
print(homelessness.head())

   Unnamed: 0              region       state  individuals  family_members  \
0           0  East South Central     Alabama       2570.0           864.0
1           1             Pacific      Alaska       1434.0           582.0
2           2            Mountain     Arizona       7259.0          2606.0
3           3  West South Central    Arkansas       2280.0           432.0
4           4             Pacific  California     109008.0         20964.0

   state_pop
0    4887681
1     735139
2    7158024
3    3009733
4   39461588

In [12]:
print(homelessness.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      51 non-null     int64
 1   region          51 non-null     object
 2   state           51 non-null     object
 3   individuals     51 non-null     float64
 4   family_members  51 non-null     float64
 5   state_pop       51 non-null     int64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.5+ KB
None

In [13]:
print(homelessness.shape)

(51, 6)

In [14]:
print(homelessness.describe())

       Unnamed: 0    individuals  family_members     state_pop
count   51.000000      51.000000       51.000000  5.100000e+01
mean    25.000000    7225.784314     3504.882353  6.405637e+06
std     14.866069   15991.025083     7805.411811  7.327258e+06
min      0.000000     434.000000       75.000000  5.776010e+05
25%     12.500000    1446.500000      592.000000  1.777414e+06
50%     25.000000    3082.000000     1482.000000  4.461153e+06
75%     37.500000    6781.500000     3196.000000  7.340946e+06
max     50.000000  109008.000000    52070.000000  3.946159e+07

In [15]:
print(str(homelessness.values), '\n')
print(str(homelessness.columns), '\n')
print(homelessness.index)

[[0 'East South Central' 'Alabama' 2570.0 864.0 4887681]
 [1 'Pacific' 'Alaska' 1434.0 582.0 735139]
 [2 'Mountain' 'Arizona' 7259.0 2606.0 7158024]
 [3 'West South Central' 'Arkansas' 2280.0 432.0 3009733]
 [4 'Pacific' 'California' 109008.0 20964.0 39461588]
 [5 'Mountain' 'Colorado' 7607.0 3250.0 5691287]
 [6 'New England' 'Connecticut' 2280.0 1696.0 3571520]
 [7 'South Atlantic' 'Delaware' 708.0 374.0 965479]
 [8 'South Atlantic' 'District of Columbia' 3770.0 3134.0 701547]
 [9 'South Atlantic' 'Florida' 21443.0 9587.0 21244317]
 [10 'South Atlantic' 'Georgia' 6943.0 2556.0 10511131]
 [11 'Pacific' 'Hawaii' 4131.0 2399.0 1420593]
 [12 'Mountain' 'Idaho' 1297.0 715.0 1750536]
 [13 'East North Central' 'Illinois' 6752.0 3891.0 12723071]
 [14 'East North Central' 'Indiana' 3776.0 1482.0 6695497]
 [15 'West North Central' 'Iowa' 1711.0 1038.0 3148618]
 [16 'West North Central' 'Kansas' 1443.0 773.0 2911359]
 [17 'East South Central' 'Kentucky' 2735.0 953.0 4461153]
 [18 'West South Central' 'Louisiana' 2540.0 519.0 4659690]
 [19 'New England' 'Maine' 1450.0 1066.0 1339057]
 [20 'South Atlantic' 'Maryland' 4914.0 2230.0 6035802]
 [21 'New England' 'Massachusetts' 6811.0 13257.0 6882635]
 [22 'East North Central' 'Michigan' 5209.0 3142.0 9984072]
 [23 'West North Central' 'Minnesota' 3993.0 3250.0 5606249]
 [24 'East South Central' 'Mississippi' 1024.0 328.0 2981020]
 [25 'West North Central' 'Missouri' 3776.0 2107.0 6121623]
 [26 'Mountain' 'Montana' 983.0 422.0 1060665]
 [27 'West North Central' 'Nebraska' 1745.0 676.0 1925614]
 [28 'Mountain' 'Nevada' 7058.0 486.0 3027341]
 [29 'New England' 'New Hampshire' 835.0 615.0 1353465]
 [30 'Mid-Atlantic' 'New Jersey' 6048.0 3350.0 8886025]
 [31 'Mountain' 'New Mexico' 1949.0 602.0 2092741]
 [32 'Mid-Atlantic' 'New York' 39827.0 52070.0 19530351]
 [33 'South Atlantic' 'North Carolina' 6451.0 2817.0 10381615]
 [34 'West North Central' 'North Dakota' 467.0 75.0 758080]
 [35 'East North Central' 'Ohio' 6929.0 3320.0 11676341]
 [36 'West South Central' 'Oklahoma' 2823.0 1048.0 3940235]
 [37 'Pacific' 'Oregon' 11139.0 3337.0 4181886]
 [38 'Mid-Atlantic' 'Pennsylvania' 8163.0 5349.0 12800922]
 [39 'New England' 'Rhode Island' 747.0 354.0 1058287]
 [40 'South Atlantic' 'South Carolina' 3082.0 851.0 5084156]
 [41 'West North Central' 'South Dakota' 836.0 323.0 878698]
 [42 'East South Central' 'Tennessee' 6139.0 1744.0 6771631]
 [43 'West South Central' 'Texas' 19199.0 6111.0 28628666]
 [44 'Mountain' 'Utah' 1904.0 972.0 3153550]
 [45 'New England' 'Vermont' 780.0 511.0 624358]
 [46 'South Atlantic' 'Virginia' 3928.0 2047.0 8501286]
 [47 'Pacific' 'Washington' 16424.0 5880.0 7523869]
 [48 'South Atlantic' 'West Virginia' 1021.0 222.0 1804291]
 [49 'East North Central' 'Wisconsin' 2740.0 2167.0 5807406]
 [50 'Mountain' 'Wyoming' 434.0 205.0 577601]]

Index(['Unnamed: 0', 'region', 'state', 'individuals', 'family_members',
       'state_pop'],
      dtype='object')

RangeIndex(start=0, stop=51, step=1)

### Sorting and Subsetting

We will use dogs dataset.

In [12]:
dogs = pd.read_csv('./datasets/dogs.csv')
print(dogs)

      name        breed  color  height_cm  weight_kg date_of_birth
0    Bella     Labrador  Brown         56         24    2013-07-11
1  Charlie       Poodle  Black         43         24    2016-09-16
2     Lucy    Chow Chow  Brown         46         24    2014-08-25
3   Cooper    Schnauzer   Gray         49         17    2011-12-11
4      Max     Labrador  Black         59         29    2017-01-20
5   Stella    Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St. Bernard  White         77         74    2018-02-27

- `df.sort_values('column_name')` changes the order of the row by sorting, passing in a _column_name_ that we want to sort by. Defaultly, ascending order. 
- `df.sort_values('column_name', ascending=False)` will sort the data the other way around.
- `df.sort_values(['column_name_1', column name 2])` will sort first by _column_name_1_, and then by _column_name_2_. This works if there are more than one entry with the same value in the column_name_1.
- `df.sort_values(['column_name_1', column name 2], ascending=[True,False])` will sort _column_name_1_ in ascending order, _column_name_2_ in descending order.
- `df['column_name']` displays the column _column_name_.
- To select multiple columns: `df[['column_name_1', column_name_2]]`. Pay attention to two pairs of square brackets.
  - __the outer square bracket is for subsetting__ the DataFrame,
  - __the inner square bracket is for creating a list of column names__ to subset.
  - We can create a separate list of column names as a variable and use that list to perform  same subsetting
        `cols_to_subset = ['column_name_1', column_name_2]`
        <br>
        `df[cols_to_subset]`
- `df['column_name'] > 50` creates a subset of boolean datatype where relevant row is __True__ if it is grater than 50, __False__ if it it less than 50, within the column _column_name_.

In [28]:
dogs['height_cm'] > 50

0     True
1    False
2    False
3    False
4     True
5    False
6     True
Name: height_cm, dtype: bool

- We can also write `df[df['column_name'] > 50]`. This creates a subset of all of the rows and columns, where _column_name > 50_.

In [29]:
dogs[dogs['height_cm'] > 50]

     name        breed  color  height_cm  weight_kg date_of_birth
0   Bella     Labrador  Brown         56         24    2013-07-11
4     Max     Labrador  Black         59         29    2017-01-20
6  Bernie  St. Bernard  White         77         74    2018-02-27

Notice that all the __True__ rows in the table one above, are now displayed in full detals in the above sub-DataFrame with the corresponding index.

- We can use the text data as well: `df[df['column_name_2'] == 'text']`. This creates a sub-DataFrame where the inputs in _column_name_ are equal to _'text'_. Say, in _column_name_2_, index 0 and index 4 are _'text'_. Then we get something like. So, in df, we filter the 'text' that are in the class column_name_2.

In [30]:
dogs[dogs['breed'] == 'Labrador']

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         24    2013-07-11
4    Max  Labrador  Black         59         29    2017-01-20

- We can also filter the DataFrame within the selected date. Date is YYYY_MM_DD, so it would be
  `df[df['column_name_5'] == 'YYYY-MM-DD']`
  Notice the date is written in quotes.

In [31]:
dogs[dogs['date_of_birth'] > '2014-01-01']

      name        breed  color  height_cm  weight_kg date_of_birth
1  Charlie       Poodle  Black         43         24    2016-09-16
2     Lucy    Chow Chow  Brown         46         24    2014-08-25
4      Max     Labrador  Black         59         29    2017-01-20
5   Stella    Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St. Bernard  White         77         74    2018-02-27

- We can also combine conditions to subset the rows: <br>
        `is_one = df['column_name_1'] == 'D'`
        <br>
        `is_four = df['column_name_4'] == 'M'`
        <br>
        `df[is_one & is_four]`  <br>
        
    This means that we filter the DataFrame with 'D' in column_name_1 and 'M' in column_name_4.

In [32]:
is_lab = dogs['breed'] == 'Labrador'
is_brown = dogs['color'] == 'Brown'
dogs[is_lab & is_brown]

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         24    2013-07-11

  We can also do this in one line of code: <br>
  `df[(df['column_name_1'] == 'D') & (df['column_name_4'] == 'M')]`
  But we add parantheses around each condition.

In [33]:
dogs[(dogs['breed'] == 'Labrador') & (dogs['color'] == 'Brown')]

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         24    2013-07-11

- If we want to filter on multiple values of a categorical variable, the easiest way is to use the isin method.  This takes in a list of values to filter for. <br>
  `is_K_or_M = df['column_name_4'].isin(['K', 'M'])`

Here, we check the column_name_4 is 'K' or 'M'.

In [36]:
is_black_or_brown = dogs['color'].isin(['Black','Brown'])
dogs[is_black_or_brown]

      name      breed  color  height_cm  weight_kg date_of_birth
0    Bella   Labrador  Brown         56         24    2013-07-11
1  Charlie     Poodle  Black         43         24    2016-09-16
2     Lucy  Chow Chow  Brown         46         24    2014-08-25
4      Max   Labrador  Black         59         29    2017-01-20

## Let's go back to our dataset Homelessness.

In [20]:
# Sort homelessness by region, then descending family members
homelessness_reg_fam = homelessness.sort_values(['region','family_members'], ascending=[True,False])

# Print the top few rows
print(homelessness_reg_fam.head())

    Unnamed: 0              region      state  individuals  family_members  state_pop
13          13  East North Central   Illinois       6752.0          3891.0   12723071
35          35  East North Central       Ohio       6929.0          3320.0   11676341
22          22  East North Central   Michigan       5209.0          3142.0    9984072
49          49  East North Central  Wisconsin       2740.0          2167.0    5807406
14          14  East North Central    Indiana       3776.0          1482.0    6695497

In [23]:
# Select only the individuals and state columns, in that order
ind_state = homelessness[['individuals','state']]

print(ind_state.head())

   individuals       state
0       2570.0     Alabama
1       1434.0      Alaska
2       7259.0     Arizona
3       2280.0    Arkansas
4     109008.0  California

In [24]:
# Filter for rows where individuals is greater than 10000
ind_gt_10k = homelessness[homelessness['individuals'] > 10000]

# See the result
print(ind_gt_10k)

    Unnamed: 0              region       state  individuals  family_members  state_pop
4            4             Pacific  California     109008.0         20964.0   39461588
9            9      South Atlantic     Florida      21443.0          9587.0   21244317
32          32        Mid-Atlantic    New York      39827.0         52070.0   19530351
37          37             Pacific      Oregon      11139.0          3337.0    4181886
43          43  West South Central       Texas      19199.0          6111.0   28628666
47          47             Pacific  Washington      16424.0          5880.0    7523869

In [25]:
# Filter for rows where region is Mountain
mountain_reg = homelessness[homelessness['region'] == 'Mountain']

# See the result
print(mountain_reg)

    Unnamed: 0    region       state  individuals  family_members  state_pop
2            2  Mountain     Arizona       7259.0          2606.0    7158024
5            5  Mountain    Colorado       7607.0          3250.0    5691287
12          12  Mountain       Idaho       1297.0           715.0    1750536
26          26  Mountain     Montana        983.0           422.0    1060665
28          28  Mountain      Nevada       7058.0           486.0    3027341
31          31  Mountain  New Mexico       1949.0           602.0    2092741
44          44  Mountain        Utah       1904.0           972.0    3153550
50          50  Mountain     Wyoming        434.0           205.0     577601

In [26]:
# Filter for rows where family_members is less than 1000 
# and region is Pacific
fam_lt_1k_pac = homelessness[(homelessness['family_members'] < 1000) & (homelessness['region'] == 'Pacific')]

# See the result
print(fam_lt_1k_pac)

   Unnamed: 0   region   state  individuals  family_members  state_pop
1           1  Pacific  Alaska       1434.0           582.0     735139

In [27]:
# The Mojave Desert states
canu = ["California", "Arizona", "Nevada", "Utah"]

# Filter for rows in the Mojave Desert states
mojave_homelessness = homelessness[homelessness["state"].isin(canu)]

# See the result
print(mojave_homelessness)

    Unnamed: 0    region       state  individuals  family_members  state_pop
2            2  Mountain     Arizona       7259.0          2606.0    7158024
4            4   Pacific  California     109008.0         20964.0   39461588
28          28  Mountain      Nevada       7058.0           486.0    3027341
44          44  Mountain        Utah       1904.0           972.0    3153550

## New columns 

This includes mutating a DataFrame, transforming a DataFrame, and _feature engineering_.

`df['new_column'] = df['column_name_3'] / 100` <br>
`print(df)`

This creates a new column after the last column of the DataFrame, with the rows are the rows of column_name_3 divided by 100.

In [41]:
dogs['height_m'] = dogs['height_cm'] / 100
print(dogs)

      name        breed  color  height_cm  weight_kg date_of_birth  height_m
0    Bella     Labrador  Brown         56         24    2013-07-11      0.56
1  Charlie       Poodle  Black         43         24    2016-09-16      0.43
2     Lucy    Chow Chow  Brown         46         24    2014-08-25      0.46
3   Cooper    Schnauzer   Gray         49         17    2011-12-11      0.49
4      Max     Labrador  Black         59         29    2017-01-20      0.59
5   Stella    Chihuahua    Tan         18          2    2015-04-20      0.18
6   Bernie  St. Bernard  White         77         74    2018-02-27      0.77

Let us calculate BMI for dogs, $$BMI = \frac{\text{weight in kg}}{(\text{height in m})^2}$$

In [43]:
dogs['bmi'] = dogs['weight_kg'] / dogs['height_m'] ** 2
print(dogs)

      name        breed  color  height_cm  weight_kg date_of_birth  height_m         bmi
0    Bella     Labrador  Brown         56         24    2013-07-11      0.56   76.530612
1  Charlie       Poodle  Black         43         24    2016-09-16      0.43  129.799892
2     Lucy    Chow Chow  Brown         46         24    2014-08-25      0.46  113.421550
3   Cooper    Schnauzer   Gray         49         17    2011-12-11      0.49   70.803832
4      Max     Labrador  Black         59         29    2017-01-20      0.59   83.309394
5   Stella    Chihuahua    Tan         18          2    2015-04-20      0.18   61.728395
6   Bernie  St. Bernard  White         77         74    2018-02-27      0.77  124.810255

<br> __Now let's find skinny tall dogs, the dogs whose bmi is less than 100.__

In [49]:
bmi_less_100 = dogs[dogs['bmi'] < 100]

# We sort the result in descending order of height in cm. We want to get tallest skinny at the top
bmi_less_100 = bmi_less_100.sort_values('height_cm', ascending=False)  

# Then, we keep only the columns we're interested in
bmi_less_100[['name','height_cm','bmi']]     # Do not forget two square brackets!!

     name  height_cm        bmi
4     Max         59  83.309394
0   Bella         56  76.530612
3  Cooper         49  70.803832
5  Stella         18  61.728395

## Let's get back to our Homelessness dataset

In [51]:
# Add total col as sum of individuals and family_members
homelessness['total'] = homelessness['individuals'] + homelessness['family_members']

# Add p_homeless col as proportion of total homeless population to the state population
homelessness['p_homeless'] = homelessness['total'] / homelessness['state_pop']

# See the result
print(homelessness.head())

   Unnamed: 0              region       state  individuals  family_members  state_pop     total  p_homeless
0           0  East South Central     Alabama       2570.0           864.0    4887681    3434.0    0.000703
1           1             Pacific      Alaska       1434.0           582.0     735139    2016.0    0.002742
2           2            Mountain     Arizona       7259.0          2606.0    7158024    9865.0    0.001378
3           3  West South Central    Arkansas       2280.0           432.0    3009733    2712.0    0.000901
4           4             Pacific  California     109008.0         20964.0   39461588  129972.0    0.003294

<br> __"Which state has the highest number of homeless individuals per 10,000 people in the state?"__

In [52]:
# Create indiv_per_10k col as homeless individuals per 10k state pop
homelessness["indiv_per_10k"] = 10000 * homelessness['individuals'] / homelessness['state_pop'] 

# Subset rows for indiv_per_10k greater than 20
high_homelessness = homelessness[homelessness['indiv_per_10k'] > 20]

# Sort high_homelessness by descending indiv_per_10k
high_homelessness_srt = high_homelessness.sort_values('indiv_per_10k', ascending=False)

# From high_homelessness_srt, select the state and indiv_per_10k cols
result = high_homelessness_srt[['state', 'indiv_per_10k']]

# See the result
print(result)

                   state  indiv_per_10k
8   District of Columbia      53.738381
11                Hawaii      29.079406
4             California      27.623825
37                Oregon      26.636307
28                Nevada      23.314189
47            Washington      21.829195
32              New York      20.392363

__Observation:__ District of Columbia has the highest number of homeless individuals - almost 54 per ten thousand people. This is almost double the number of the next-highest state, Hawaii.